{"./Chip-8 Games/15 Puzzle [Roger Ivie] (alt)": {"name": "15 Puzzle [Roger Ivie] (alt)", "file": "Chip-8 Games/15 Puzzle [Roger Ivie] (alt).ch8", "sys": "ch8", "description": ""}, "./Chip-8 Games/15 Puzzle [Roger Ivie]": {"name": "15 Puzzle [Roger Ivie]", "file": "Chip-8 Games/15 Puzzle [Roger Ivie].ch8", "sys": "ch8", "description": "Same than PUZZLE2. Wait for randomization... Instead of moving the item by pressing his associated key, move it UP DOWN LEFT RIGHT with respectively 2 8 4 6. Up and Down are inverted as the game uses the original CHIP8 keyboard."}, "./Chip-8 Games/Addition Problems [Paul C": {"name": "Addition Problems [Paul C", "file": "Chip-8 Games/Addition Problems [Paul C. Moews].ch8", "sys": "ch8", "description": ""}, "./Chip-8 Games/Airplane": {"name": "Airplane", "file": "Chip-8 Games/Airplane.ch8", "sys": "ch8", "description": ""}, "./Chip-8 Games/Animal Race [Brian Astle]": {"name": "Animal Race [Brian Astle]", "file": "Chip-8 Games/Animal Race [Brian Astle].ch8", "sys": "ch8", "description": "9. VIP Animal Race\n\nAnimal Race is a fun game for one person, with an element of luck - sure to\nput a smile on your face.  Five different animals race against one another\nand you have the chance to test your expertise at picking the winner.\n\n\nHow To Play Animal Race\n\n1. Load the CHIP-8 interpretor at 0000-01FF\n   and the game starting at 0200.\n\n2. Turn RUN switch on.\n\n3. Wait until the animals are lined up and read to start, then select an animal\n   by pressing a letter A through E.  A mark will appear to the left of the\n   animal to remind you of the one you have selected.\n\n4. Decide how much you want to bet (up to a limit of $9), then press that key.\n\n5. After the race is over, press zero (or any key) to start the next race.\n   Your winnings or losses will be computed and the new total displayed at\n   the begining of the next race.\n\nHints for expert players\nAll animals move at approximately the same speed, but they start from different\npositions.  The odds for each animal are related to the starting position but\ninclude a random element.  Some races favor the player and you should bet up to\nthe limit on these.  Some races are unfavorable and you should bet carefully\non these.\n\nYou can win the game by accumulating $256 or more.\n"}, "./Chip-8 Games/Astro Dodge [Revival Studios, 2008]": {"name": "Astro Dodge [Revival Studios, 2008]", "file": "Chip-8 Games/Astro Dodge [Revival Studios, 2008].ch8", "sys": "ch8", "description": "-----------------------------------------------------------------------------\n\t\t\t      /////////////////\n\t                      //////////////////\n        \t              ////          ////\n\t               \t      ////   ///////////\n\t                      ////  ///////////\n                              ////  ////\n                              ////  ///////////\n                              ////   //////////\n  \t     \t   \t\n  \t\t\t   www.revival-studios.com\n-----------------------------------------------------------------------------\nTitle\t\t:\tAstro Dodge\nAuthor\t\t:\tMartijn Wenting / Revival Studios\nGenre\t\t:\tGame\nSystem\t\t:\tChip8 / SuperChip8\nDate\t\t:\t18/12/2008\nProduct ID\t:\tRS-C8003\n-----------------------------------------------------------------------------\n\nAll the contents of this package are (c)Copyright 2008 Revival Studios.\n\nThe contents of the package may only be spread in its original form, and may not be\npublished or distributed otherwise without the written permission of the authors.\n\nDescription:\n------------\nAstro Dodge is an arcade game for the Chip8 and SuperChip8 systems.\nBoth versions of the game are included in this package.\n \nYour goal is to make your way through the asteroids field and dodge the asteroids, scoring points for each asteroid you are able to dodge.\nButton 2,4,6,8 will move your ship, button 5 will start the game.\n\nRunning the game(s):\n--------------------\nThe CHIP8 version of the game has been programmed to be compatible with original hardware like the Cosmac VIP and Telmac 1800.\nUse the Megachip emulator or any other Chip8/SuperChip compatible emulator to run the game(s).\n\nCredits:\n--------\nProgramming and Graphics by: Martijn Wenting\n\nDistribution:\n-------------\nThis package can be freely distributed in its original form.\nIf you would like to include this game in your rom package, please let me know.\n\nWatch out for more releases soon!\n\n\n\tMartijn Wenting / Revival Studios\n\n"}, "./Chip-8 Games/Biorhythm [Jef Winsor]": {"name": "Biorhythm [Jef Winsor]", "file": "Chip-8 Games/Biorhythm [Jef Winsor].ch8", "sys": "ch8", "description": "13. VIP Biorhythm\n\nThe theory of Biorhythm states that there are thre predominant cycles that can influence\nhuman behavior.  These include a 23-day physical cycle, a 28-day emotional cycle and a\n33-day intellectual cycle.  All three cycles start at birth and continue throughout life.\n\nEach cycle consists of a positive and a negative period.  Physical, Emotional and\nIntellectual aspects are enhanced during positive periods.  Poor performance is\nindicated by the negative period of a cycle.\n\nA critical day occurs on the crossover from the positive to the negative period or\nvice versa.  A critical day indicates instability in a particular aspect.\n\n\nHow to Use VIP Biorhythm\n\n1. Load the CHIP-8 interpreter at 0000-01FF and\n   the game starting at 0200.\n\n2. Turn RUN switch on.\n\n3. Enter birthdate using 2-digit month, 2-digit day, and 4-digit year.\n\n4. Enter start date using 2-digit month, 2-digit day, and 4-digit year. The start date\n   indicates the first day of the 32-day Biorhythm chart the program will generate.\n\n5. After a period of calculation proportional to the span of time involved, the three\n   cycle curves will be shown for a 32-day period.  Each horizontal bit position\n   represents one day in the cycle.  The start day, on the left, and every seventh\n   day are indicated by week markers.  The first day of a positive or negative period\n   is a critical day.\n\n6. To advance the start date, hold key F down until the desired date is reached.\n   To decrement the start date, hold key B down.  These functions allow changing the\n   start date slightly without reentering all the dates and waiting for the calculations\n   to be preformed.\n  \n7. Press Key 0 to clear the screen and enter a new set of dates.\n\n   \n\n   See VIPG1-13.jpg\n\n\nINTERPRETATION\n\n\n\t\t\tPhysical\t\tEmotional\t\tIntellectual\n\nPositive Period\t\tStrong, \t\tGood moods, \t\tGood Judgement\n(Up)\t\t\tVigorous\t\tCooperative\t\tSharp Mentally\n\nNegative Period\t\tTire easily,\t\tLow Enthusiasm,\t\tLow attentiveness\n(Down)\t\t\tLess Stamina\t\tFeelings Subdued\tand concentration\n\nCritical Days\t\tSusceptible to injury\temotionally unstable,\tPoor memory,\n(Crossover)\t\tor Illness,\t\tUpset easily\t\tProne to mistakes\n\t\t\tLow endurance\n"}, "./Chip-8 Games/Blinky [Hans Christian Egeberg, 1991]": {"name": "Blinky [Hans Christian Egeberg, 1991]", "file": "Chip-8 Games/Blinky [Hans Christian Egeberg, 1991].ch8", "sys": "ch8", "description": ""}, "./Chip-8 Games/Blinky [Hans Christian Egeberg] (alt)": {"name": "Blinky [Hans Christian Egeberg] (alt)", "file": "Chip-8 Games/Blinky [Hans Christian Egeberg] (alt).ch8", "sys": "ch8", "description": ""}, "./Chip-8 Games/Blitz [David Winter]": {"name": "Blitz [David Winter]", "file": "Chip-8 Games/Blitz [David Winter].ch8", "sys": "ch8", "description": "Blitz, by: David Winter\n\nThis game is a BOMBER clone. You are in a plane, and you must destroy the towers of a town. Your plane is flying left to right, and goes down. Use 5 to drop a bomb. The game ends when you crash yourself on a tower...\n\n"}, "./Chip-8 Games/Bowling [Gooitzen van der Wal]": {"name": "Bowling [Gooitzen van der Wal]", "file": "Chip-8 Games/Bowling [Gooitzen van der Wal].ch8", "sys": "ch8", "description": "7. VIP Bowling\n\nBowling is a great game for recreation and competion requiring skill and a little\nbit of luck.  This program simulates bowling closely with regular scoring and the\noption of using three different spins on the ball.\n\nHow to play VIP Bowling\n\n1. Load the CHIP-8 interpretor at 0000-01FF\n   and the game starting at 0200.\n\n2. Turn RUN switch on.\n\n3. Up to 6 persons can compete.  Make the choice by pressing Key 1,2,3,4,5 or 6.\n   The players will be referred to as A,B,C,D,E and F.\n\n4. It is possible to play up to 10 frames in one game.  Make your choice of the\n   number of frames by pressing Key 1,2,3,4,5,6,7,8,9 or 0 (for 10 frames).\n\n5. It is possible to choose 3 ball speeds (Key 1,2 or 3).  The speed option only\n   affects the ball after it is released.\n\n6. At the start of a player's turn, the video will display whose turn it is and\n   whether he is working on a spare, strike, 2 strikes or nothing.\n   Release the ball by pressing on of the following keys: Key 1,2,3,5,7,8 or 9.\n   -Key 5 will cause a straight ball.\n   -Key 1,2 and 3 will cause the ball to spin up.\n     -Key 1 before the first pin\n     -Key 2 after  the first pin\n     -Key 3 after  the second pin\n   -Key 7,8 and 9 will cause the ball to spin up.\n     -Key 7 before the first pin\n     -Key 8 after  the first pin\n     -Key 9 after  the second pin\n\n7. After the player's turn ends, the video will display whose turn it was, the\n   frame, and the score.  The next players follows the instructions at 6 above.\n\n8. After all players have had their turn in a frame, the video will display the\n   total of each player and whether he is working on a spare, 1 strike, 2 strikes\n   or nothing.  It will display the frame number and the total number of frames\n   to go (unless the last frame was played).\n   After pressing Any key, player A can start in the next frame.  Continue with\n   instruction 6 above.\n\n9. If all frames in the game have been finished, press any key again.  The player's\n   who are still working on a spare will recieve 1 more ball, and those working\n   on 1 or 2 strikes will receive 2 balls.\n\n10. After all players have finished the game, the final score will be displayed.\n\n\n    "}, "./Chip-8 Games/Breakout (Brix hack) [David Winter, 1997]": {"name": "Breakout (Brix hack) [David Winter, 1997]", "file": "Chip-8 Games/Breakout (Brix hack) [David Winter, 1997].ch8", "sys": "ch8", "description": "Breakout (Brix hack), by: David Winter\n\nThis game is an \"arkanoid\" precursor. You have 5 lives, and your goal is the destruction of all the brixs. Use 4 and 6 to move your paddle. The game ends when all the brixs are destroyed.\n\nThis game is the same than BRIX, but has graphics looking like the game on the Atari 2600 console.\n\n"}, "./Chip-8 Games/Breakout [Carmelo Cortez, 1979]": {"name": "Breakout [Carmelo Cortez, 1979]", "file": "Chip-8 Games/Breakout [Carmelo Cortez, 1979].ch8", "sys": "ch8", "description": "Breakout, by: Carmelo Cortez\n\nThe game, Breakout, is a variation of the Wipe-Off game.\nYou have six walls and 20 balls to start. To win you must get through all walls to the top of the screen. At the end of the game the program will show the number of times you hit the walls and will show \"FREE!\" if you get through."}, "./Chip-8 Games/Brick (Brix hack, 1990)": {"name": "Brick (Brix hack, 1990)", "file": "Chip-8 Games/Brick (Brix hack, 1990).ch8", "sys": "ch8", "description": "BRICK: a modified version of BRIX, a CHIP-8 game.\nOriginal BRIX by Andreas Gustafsson.\nThis one is a solid wall; no air between bricks!"}, "./Chip-8 Games/Brix [Andreas Gustafsson, 1990]": {"name": "Brix [Andreas Gustafsson, 1990]", "file": "Chip-8 Games/Brix [Andreas Gustafsson, 1990].ch8", "sys": "ch8", "description": ""}, "./Chip-8 Games/Cave": {"name": "Cave", "file": "Chip-8 Games/Cave.ch8", "sys": "ch8", "description": ""}, "./Chip-8 Games/Coin Flipping [Carmelo Cortez, 1978]": {"name": "Coin Flipping [Carmelo Cortez, 1978]", "file": "Chip-8 Games/Coin Flipping [Carmelo Cortez, 1978].ch8", "sys": "ch8", "description": "Coin Flipping, by: Carmelo Cortez\n\nThe game is a Coin FlLpping program. Flip run up and the\ncomputer starts to flip a coin, and at the same tine shosing heads\nand tails on the screen, stopping at the value set in VC.\n"}, "./Chip-8 Games/Connect 4 [David Winter]": {"name": "Connect 4 [David Winter]", "file": "Chip-8 Games/Connect 4 [David Winter].ch8", "sys": "ch8", "description": "Connect 4, by: David Winter\n\nThis game is for two players. The goal is to align 4 coins in the\ngame area. Each player's coins are colored. When you drop a coin,\nit is paced on the latest dropped coin in the same column, or at\nthe bottom if the column is empty. Once the column is full, you\ncannot place any more coins in it. To select a column, use 4 and 6.\n\nTo drop a coin, use 5. There is no winner detection yet. This will\nbe soon avalaible (Hey! I don't spend my life on CHIP8 !).\n"}, "./Chip-8 Games/Craps [Camerlo Cortez, 1978]": {"name": "Craps [Camerlo Cortez, 1978]", "file": "Chip-8 Games/Craps [Camerlo Cortez, 1978].ch8", "sys": "ch8", "description": "Craps, by: Camerlo Cortez\n\nTo use the Craps program, press any key to roll dice.\n7 or 11 wins, 12, 2 or 3 loses on first roll. The second roll must match the first to win, but if you roll a seven you lose. This program could be expanded to include on-the-screen scoring of bets.\n"}, "./Chip-8 Games/Deflection [John Fort]": {"name": "Deflection [John Fort]", "file": "Chip-8 Games/Deflection [John Fort].ch8", "sys": "ch8", "description": "8.  VIP DEFLECTION\n\nIn the VIP Deflection game you position mirrors anywhere on the display screen.\nThe object of the game is to deflect a ball of the mirrors a maximum number of\ntimes before hitting the target.\n\nThe number of deflections times the target number gives you deflection points.\nThese are added to your previous point total.  If you fail to hit the target you\nget no points.  The winner of the game is the player who accumulates 257 or\nmore deflected points.\n\nHow to Play VIP Deflection\n\n1. Load the CHIP-8 interpretor at 0000-01FF\n   and the game starting at 0200.\n\n2. Turn RUN switch on.\n\n3. After the scores appear a letter, the target with a number and a ball.  The\n   letter signifies the player who will program the mirrors.  This sequence will\n   be repeated until there is a winner.\n\n4. To program the mirrors, select the proper mirror type by using Table 1 (VIP1-8.jpg)\n   as a guide.  Key 1 will place a horizontal mirror on the board.  Key 2 selects a\n   vertical mirror, Key 3 a slant-left mirror, Key 4 a slant-right mirror.\n\n5. After a mirror has been selected, you may position the mirror by using keys 1\n   through 4 and 6 through 9 (see Table 2 for movement of a mirror).  Once a\n   mirror has been selected and positioned, it may be fixed into position by pressing\n   Key 5.\n\n   Table 2 - Mirror Positioning and Ball Direction\n   Key Selection     |  Positioning and Direction\n   ------------------+---------------------------\n         1           |  up and to the left\n         2           |  up\n         3           |  up and to the right\n         4           |  left\n         5           |  right\n         7           |  down and to the left\n         8           |  down\n         9           |  down and to the right\n\n6. You may position up to 10 mirrors on the game board.  After you have the maximum\n   amount on the board you must press Key 0 to progress to the fire mode.  If you\n   wish to progress to the fire mode with less than 10 mirrors programmed, you may\n   do so by pressing Key 0.  You fire the ball in the direction you want by using\n   Keys 1 through 4 and Keys 6 through 9 (see Table 2).\n\n7. After the ball has reached the target or leaves the game board, the player's\n   score is computed and displayed and a new ball and target appear.\n\n\n\n"}, "./Chip-8 Games/Figures": {"name": "Figures", "file": "Chip-8 Games/Figures.ch8", "sys": "ch8", "description": ""}, "./Chip-8 Games/Filter": {"name": "Filter", "file": "Chip-8 Games/Filter.ch8", "sys": "ch8", "description": ""}, "./Chip-8 Games/Guess [David Winter] (alt)": {"name": "Guess [David Winter] (alt)", "file": "Chip-8 Games/Guess [David Winter] (alt).ch8", "sys": "ch8", "description": "Think to a number between 1 and 63. CHIP8 shows you several boards and you have to tell if you see your number in them. Press 5 if so, or another key if not. CHIP8 gives you the number...\n"}, "./Chip-8 Games/Guess [David Winter]": {"name": "Guess [David Winter]", "file": "Chip-8 Games/Guess [David Winter].ch8", "sys": "ch8", "description": "Think to a number between 1 and 63. CHIP8 shows you several boards and you have to tell if you see your number in them. Press 5 if so, or another key if not. CHIP8 gives you the number...\n"}, "./Chip-8 Games/Hi-Lo [Jef Winsor, 1978]": {"name": "Hi-Lo [Jef Winsor, 1978]", "file": "Chip-8 Games/Hi-Lo [Jef Winsor, 1978].ch8", "sys": "ch8", "description": "Hi-Lo, by: Jef Winsor\n\nYou have 10 chances to guess the value of a random number between 00 and 99 selected by the program. The number at the right of the screen shows the number of the guess you are using. Enter a two digit number and the computer tells you if you are high or low. Press any key to erase this number and then, try again. If you have failed after ten guesses, press any key and the number will be shown. If you are good you will never need more than seven guesses. \n"}, "./Chip-8 Games/Hidden [David Winter, 1996]": {"name": "Hidden [David Winter, 1996]", "file": "Chip-8 Games/Hidden [David Winter, 1996].ch8", "sys": "ch8", "description": "                ----------------------------------------\n                                 HIDDEN!\n                    Copyright (1996) by David WINTER\n                ----------------------------------------\n\n\nHIDDEN is a \"memory\" game. It is very simple to play.\n\nThe rules are as follow: your goal is to find all the identical cards\nin a minimum time.\n\nYou are playing in a 4*4 card grid. You can see only two cards at the\nsame time. Once this time passed, these two cards will remain shown\nif they are identical, otherwise they will be hidden again.\n\nWhen the game is finished, two scores are shown:\n        SC is your score, corresponding to the number of tries\n        HI is the best score (smallest number of tries made to finish)\n\nThe keys are:\n\n        [2] : More DOWN\n        [4] : Move LEFT\n        [5] : Show card\n        [6] : Move RIGHT\n        [8] : Move UP\n\nEnjoy !!!\n"}, "./Chip-8 Games/Kaleidoscope [Joseph Weisbecker, 1978]": {"name": "Kaleidoscope [Joseph Weisbecker, 1978]", "file": "Chip-8 Games/Kaleidoscope [Joseph Weisbecker, 1978].ch8", "sys": "ch8", "description": "VIP Kaleidoscope, by: Joseph Weisbecker\n\nFour spots appear in a group at the center of the screen. Press keys 2, 4,  6, or 8 to create a pattern. Keep your pattern smaller than 138 key depressions.\n\nPush key 0 to terminate pattern entry. Pushing key 0 causes your pattern to be continuously repeated forming a fascinating, changing kaleidoscope display on the screen. A \"44444442220\" key sequence provides a very nice effect Experiment to\nfind other nice patterns. \n\n"}, "./Chip-8 Games/Landing": {"name": "Landing", "file": "Chip-8 Games/Landing.ch8", "sys": "ch8", "description": ""}, "./Chip-8 Games/Lunar Lander [Udo Pernisz, 1979]": {"name": "Lunar Lander [Udo Pernisz, 1979]", "file": "Chip-8 Games/Lunar Lander [Udo Pernisz, 1979].ch8", "sys": "ch8", "description": "15. Lunar Lander\n\nYou are descending to the floor of a 250-foot crater.  The right side of the TV display\nshows amount of fuel, feet from bottom and fall rate per cycle.  Lenght of fall rate\ncycle changes from about 1/4 second to one second.  The fall rate increases by one\nfoot per second/per cycle.  The computer will update the display only at the end of\neach cycle.\n\nThe left side of the display shows the Lunar Lander descending from 250 feet.  The\nLander will first appear at one of sixteen locations.  It will then slowly drop down\nthe crater.  The crater walls have rock formations protruding from them which must\nbe avoided.  If either rocket motor should touch any part of the crater, the Lander\nwill explode in a cloud of smoke and disintegrate.  (Remember, these are atomic\nthrusters and react like miniature atomic bombs upon impact).\n\nWhen you reach 32 feet, the display will change, and you will see the crater floor.\nYou must now ladn between the rock formations on the floo and maintain a minimum fall\nrate.  As you drop your fall rate to zero, you soon discover that the Lander becomes\nmore and more unstable just as any hovering object would.  And now with perfect skill\nyou guide the ship in for a perfect touch down, or?\n\nHow to Play VIP Lunar Lander\n\n1. Load the CHIP-8 interpreter at 0000-01FF and teh game starting at 0200.\n\n2. Key 2 controls the thrust of the Lunar Lander.  One tone beep equals one pound\n   of fuel and one foot of thrust.\n\n3. Key 4 controlls the horizontal stabilizing engine,  and moves the Lander one\n   foot to the left per one pound of fuel.\n\n4. Key 6 controls the stabilization to the right.\n\n5. Stabilization controls only react after: (a) a complete fall cycle, or (b) after\n   the Key 2 thrust control is pressed.  You must be aware of this at all times or\n   you will crash even though either key 4 or 6 is pressed.\n\n6. At the end of each cycle, the Lunar Lander will move randomly at the rate of one\n   foot either right or left.  Therefore, as the fall rate approaches zero, the Lander\n   becomes more uncontrollable, and your horizontal stabilizers react more quickly.\n   (Just like the real thing).\n\n7. If you land too fast, the Lander will bounce and flip over.\n\n8. If you run out of fuel, the Lander will crash.\n\n9. You will not be allowed to go above 250 feet.  If you try to do so, you will just\n   waste precious fuel.\n\n10. Once you reach 32 feet and move into the landing display, you will not be allowed\n    to rise above 26 feet.  Trying to do so will waste more precious fuel.\n\n11. Game options\n  \n    You may select one of three options at the begining of the game.\n\n    Option 1: You start at 250 feet.  You are given 150 pounds of fuel.  You must land\n              at 5 feet per second or less.  The initial descent display is easy to\n              maneuver through.\n\n    Option 2: You start at 250 feet.  You have 200 pounds of fuel.  You must land at 3 feet\n              per second or less.  The initial descent display is hard to maneuver through.\n\n    Option 3: You start at 32 feet.  You have 100 pounds of fuel.  You must land at 3 feet\n              per second or less.  This display allows you to practice landing.  \n\n    You should consider Option 2 as the complete game when trying for Astronaut Ratings.\n\n12. Astronaut Ratings\n\n    The computer will award you with ratings depending on how good a lander you are.\n\n    You will obtain the rating of Astronaut by landing without regard to fall rate or\n    fuel.  You must not exceed fall rate, or zero fuel.\n    \n    You will obtain the rating of Astronaut Pilot, by ladning with regard to fuel.  80\n    pounds or more if you land between the two rock formations on the floor, and 50\n    pounds or more if you land between the crater wall and a rock formation.\n\n    You will obtain the rating of Astronaut Captain by landing the ship with regard to\n    fuel as per above and if the fall rate is two feet per second or less.  (Not an\n    easy task, as you will soon discover).\n\n13. About Graphics\n\n    This game has some interesting graphic displays when you run out of fuel, crash,\n    land too fast, when you land successfully.  I will leave them to your discovery,\n    as they are fun to watch.\n\n14. Landing Sites\n\n    The final landing display will appear somewhat like the illustration below\n    (VIPG1-15.jpg).  You may land in any of the three locations pointed to.  To land\n    between the crater walls and rock formations, you will have to first bring the\n    Lander to a zero fall rate while hovering in the center landing area.  Then bring\n    the ship up and just over the rock formation, and let it drop down to the landing\n    site.  At the last moment, a few taps on the thruster button will slow the lander\n    to the required fall rate.  It will take you many tries to land here, but don't\n    give up, it can be done!!\n\nNOTE:  VIP Lunar Lander requires at least 3K of RAM.  RAM memories are available to\n       increase your VIP from 2K to 3K at your local computer store or by contacting:\n                        RCA VIP Marketing\n                        New Holland Avenue\n                        Lancaster, PA 17604\n"}, "./Chip-8 Games/Mastermind FourRow (Robert Lindley, 1978)": {"name": "Mastermind FourRow (Robert Lindley, 1978)", "file": "Chip-8 Games/Mastermind FourRow (Robert Lindley, 1978).ch8", "sys": "ch8", "description": "\t\tMASTERMIND\n\t\t   by\n\t      Robert Lindley\n\nI have progranmed two versLons of the game Mastermind. This game is distributed by Invicta Plastics, Suite 940, 200 - 5th Ave., New York, NY 10010, and is available most pLaces where toys and games are sold.\nFor complete details of the game, please refer to their instructions. The information given here refers to this particular VIP iurplementation.\nThe two versions are essentially the same except that the first has a four number code and the second has a five  nr:mber hidden code selected at random..  In the four number version, the digits one through six are used and in the five  number version the diglts zero through seven are used.\nWhile the game is running, the other hex keys, except key F, have no effect. Key F is used when you change your mind and want to change your input. This key erases the current partial entry.\nThe game starts by displaying a series of dashes arranged in rows. As the game progresses, the player attempts to  deduce the hidden code by replacing the dashes with digits entered via the hex keyboard. Each tlme a hex key is used, the selected digit replaces a dash in  one vertical column. This vertical column is one guess of the ten allowed to deduce\nthe hidden number. When the bottom dash in any column is replaced by a digit,  that try is imidiately scored. This score appears below the current column. If any digit in the column exactly matches the hidden number digit in the same row, a broken bar will appear. then four or five (one for each row in the game) appear, the hidden number has been deduced\nand it will be revealed at the right end of  the screen. If any digit in the column matches a hidden digit, but in an incorrect erorr, a white bar will appear. Note that the scoring is across all rows. For example, if there are two fives in a column and one of then is in the correct row and there is only one five in the hidden numbers, one broken bar will appear.\nWhen all allowed ten tries  have been used, the hidden number will be revealed. \n\n"}, "./Chip-8 Games/Merlin [David Winter]": {"name": "Merlin [David Winter]", "file": "Chip-8 Games/Merlin [David Winter].ch8", "sys": "ch8", "description": "Merlin, by: David Winter\n\nThis is the SIMON game. The goal is to remember in which order the squares are lighted. The game begins by lighting 4 random squares, and then asks you to light the squares in the correct order.\nYou win a level when you give the exact order, and each increasing level shows a additionnal square. The game ends when you light an incorrect square. Keys are 4 and 5 for the two upper squares, then 1 and 2 for the two other ones.\n"}, "./Chip-8 Games/Missile [David Winter]": {"name": "Missile [David Winter]", "file": "Chip-8 Games/Missile [David Winter].ch8", "sys": "ch8", "description": ""}, "./Chip-8 Games/Most Dangerous Game [Peter Maruhnic]": {"name": "Most Dangerous Game [Peter Maruhnic]", "file": "Chip-8 Games/Most Dangerous Game [Peter Maruhnic].ch8", "sys": "ch8", "description": "10. VIP Most Dangerous Game\n\nVIP Most Dangerous Game pits a hunter against a hunted in a maze.  The hunter must\nshoot the hunted before either time runs out or the hunted escapes the maze.\nHowever, neither the hunted nor the hunter can see a wall in the maze until he runs\ninto it.  There is always at least one path through the maze.\n\nHow To Play VIP Most Dangerous Game\n\n1. Load the CHIP-8 interpretor at 0000-01FF\n   and the game starting at 0200.\n\n2. Turn RUN switch on.\n\n3. Hunted's turn:\n   When the arrow appears in the lower left, it is the hunted's turn.  Keys 2-4-6-8\n   control direction (up-left-right-down, respectively).  The hunted continues to\n   move until a) he makes 5 moves, b) he hits a wall or c) key 0 is pressed.\n\n4. Hunter's turn\n   When the arrow appears in the lower right, it is the hunter's turn.  The hunter's\n   turn consists of two modes, the move and the shoot.  Keys 2-4-6-8 and 0 control both\n   modes.  Like the hunted, the hunter continues to move until a) he makes 3 moves,\n   b) he hits a wall or c) key 0 is pressed.  If he hits the wall, case b), he cannot\n   fire a bullet.  The hunter may fire one of his bullets using the direction keys\n   2-4-6-8.  The bullet will travel four squares in the corresponding direction, unless\n   a wall is encountered.  If the hunter prefers not to use a bullet, he must press key 0.\n\n5. Repeat steps 3 and 4 until:\n   a) The number of turns (upper left on the display) expire.  The hunted wins.\n   b) The hunter lands on or shoots the hunted.  The hunter wins.\n   c) The hunted lands on hunter, thereby giving up.  The hunter wins.\n   d) The hunted reaches the lower right corner of the maze with at least 1 move\n      remaining in his turn.  The hunted wins, by escaping the maze.\n\n6. Variations of VIP Most Dangerous Game may be played by changing certain bytes in\n   the program.\n\nLocation Default Meaning\n0215\t 0F\t Number of turns in the game.\n0217\t 06\t Number of bullets hunter has at start.\n0219\t 03\t Number of moves per turn for the hunter.\n0221\t 01\t Number of squares per move (hunted and hunter).\n022B\t 05\t Number of moves per turn for the hunted.\n024B\t 01\t If zero, walls are invisible.\n0355\t 04\t Number of squares a bullet will go.\n04E3\t 70\t Probability (out of 100Hex) of a wall appearing.\n04EB\t FE\t If FF, a wall may appear at previously tested boundaries.\n"}, "./Chip-8 Games/Nim [Carmelo Cortez, 1978]": {"name": "Nim [Carmelo Cortez, 1978]", "file": "Chip-8 Games/Nim [Carmelo Cortez, 1978].ch8", "sys": "ch8", "description": "Nim, by: Carmelo Cortez\n\nThe Nim Game is a little less graphic than most games. The player may go first by pressing. \"F\" key, any other let the computer go first.\nYou subtract 1, 2 or 3 fron the score. The one who ends up with the  last number loses!"}, "./Chip-8 Games/Paddles": {"name": "Paddles", "file": "Chip-8 Games/Paddles.ch8", "sys": "ch8", "description": ""}, "./Chip-8 Games/Pong (1 player)": {"name": "Pong (1 player)", "file": "Chip-8 Games/Pong (1 player).ch8", "sys": "ch8", "description": ""}, "./Chip-8 Games/Pong (alt)": {"name": "Pong (alt)", "file": "Chip-8 Games/Pong (alt).ch8", "sys": "ch8", "description": ""}, "./Chip-8 Games/Pong 2 (Pong hack) [David Winter, 1997]": {"name": "Pong 2 (Pong hack) [David Winter, 1997]", "file": "Chip-8 Games/Pong 2 (Pong hack) [David Winter, 1997].ch8", "sys": "ch8", "description": ""}, "./Chip-8 Games/Pong [Paul Vervalin, 1990]": {"name": "Pong [Paul Vervalin, 1990]", "file": "Chip-8 Games/Pong [Paul Vervalin, 1990].ch8", "sys": "ch8", "description": "OK. here is PONG version 1.1.  The ball is a little faster in this\nversion making play a little more realistic.  I know PONG 1.0 was\njust posted yesterday, but I think this version is significantly\nbetter, so here it is.\n\nUse keys 7 and 4 move left player and / and * move right player.\n\nEnjoy!!\n\n"}, "./Chip-8 Games/Programmable Spacefighters [Jef Winsor]": {"name": "Programmable Spacefighters [Jef Winsor]", "file": "Chip-8 Games/Programmable Spacefighters [Jef Winsor].ch8", "sys": "ch8", "description": "14. VIP Programmable Spacefighters\n\nProgrammable Spacefighters is a combat game involving 2 to 8 spaceships competing\nfor the domination of a contained field in space.  The field of play is a \ntwo-dimensional representation of an oblong spheroid.\n\nThe movement and fire of each spacefighter is controlled by programming a series of\ncommands into each fighter's instruction storage table.  Once all the spacefighters\nare programmed, they carry out their commands by sequentially executing a single step\nat a time.  The play of the game ins divided into rounds.  Each spacefighter may\nexecute between 1 and 15 commands per round.\n\nThe fighters all have the same appearance and capabilities.  Players distinguish\nbetween fighters by examining the defense strength and position of their fighters\nat the begining of every round.\n\nEach fighter may face in any of 8 directions.  All firing and forward movement\noccurs in the direction the fighter is currently facing.  As a spacefighter crosses\noutside the two-dimensional field of play, it wraps around and re-enters on the\nopposite side of the field.  Laser bursts terminate when they travel outside the\nfield or hit a target.\n\nEach round consists of a selected number of steps.  Each step is executed in 2 parts.\nDuring the first part, every spacefighter wishing to fire may execute a fire operation.\nThe defense strength of any fighter which is hit by a laser burst is reduced by 1\nand a small flash appears.\n\nAfter all fighters have had an opportunity to execute fire instructions, the movement\npart of the step begins.  Any fighter which has had its defense strength reduced to 0\nis destroyed and a longer flash appears.  The defense strength is changed to a special\ncode so that the fighter will no longer be programmable or take part in the execution\nphase.  The destroyed fighter will still be open to examination during the Defense/\nPosition Check phase.  Fighers having a defense strength greater than 0 may execute\na movement command if there is one.  Breaking each step into 2 such parts removes any\nstrategic advantage to moving first.\n\nThe nature of the game, in that there are variable parameters and no fixed victory\nconditions, allows the players a lot of freedom.  Two to eight players can command\nsingle fighters.  Four or less players can each command multiple fighters.  Two\nfleets could complete to destroy their opponents' flagship first.  Handicaps can\nbe implemented through an imbalance of fighters in different fleets.  An odd number\nof players can play in a free for all or team game.  In a non-combat approach, a full\ncomplement of space fighters could be programmed to preform in kaleidoscope or other\ntype formations.\n\n\nHow to Play VIP Programmable Spacefighters\n\n1. Load the CHIP-8 interpreter at 0000-01FF and\n   the game starting at 0200.\n\n2. Turn RUN switch on.\n\n3. Initalization of Game.\n   Various parameters are entered at the start of the game to determine the number\n   of spacefighters and other aspects of play.\n\n   S: Enter number of spacefighters.  1 to 8 spacefighters may be used.  The program\n      will adjust invalid enteries to the nearest valid number.\n\n   D: Enter defense strength.  A spacefighter may be hit from 1 to F times by laser\n      before being destroyed.\n\n   E: Enter number of command entries.  A spacefighter may be programmed with 1 to F\n      commands during the programming phase of each round.\n\n   C: Enter clock duration/no clock.  A timer clock 1 to F phorseks in duration may\n      be selected.  Each phorsek equals 4 seconds.  The clock is not enabled if a 0\n      is entered.  The clock time is the time allowed for each fighter to be set up.\n\n   F: Enter fire power available.  A spacefighter may be allowed to fire 1 to F\n      laser bursts per round.\n\n   A: Enter accumulation/no accumulation.  A spacefighter may be allowed to accumulate\n      all unused laser bursts by entering 1 to F.  Accumulation is not allowed if a\n      0 is entered.\n\n4. Presentation of Field and Spacefighters.\n   The two-dimensional representation of the palying fields consists of 10 vertical\n   by 15 horizontal positons indicated by grid markings around the perimeter.  The\n   spacefighters will be in their initial positions.\n\n5. Defense/Position Check.\n     Enter number of spacefighter to be examined.\n     S: Current spacefighter being examined.\n     D: Defense strength of current spacefighter.\n     Enter 0 to end defense/position check phase.\n\n6. Program Spacefighters.\n   Surviving spacefighters are programmed in ascending order.  Enter 0 to begin\n   programming first spacefighter.  Defense strength and position are shown during\n   programming.\n     E: indicates number of enteries left after current command.\n     C: indicates time remaining to program current fighter if clock was entered.\n\n    COMMAND   FUNCTION\n      1        Rotate 45 ccw, Move fwd\n      2        Move fwd\n      3        Rotate 45 cw, Move fwd\n      4        Rotate 45 ccw\n      5        Fire\n      6        Rotate 45 cw\n      B        Erase all commands and reprogram current spacefighter\n      E        End programming of current spacefighter\n      7-A,C,D,F  Rest, No operation\n      0        Rest, Begin programming next spacefighter\n\n   Enter 0 to begin programming each successive spacefighter.\n\n7. Execute Commands.\n   Enter 0 after all spacefighters are programmed to start execution of commands.\n\n8. The recommended starting point when tryint the game out is with 1 or 2 spacefighters,\n   any defense, F (15) entries per round, no clock, F (15) fire power and any accumulation\n      S: 1 or 2\n      D: 1\n      E: F\n      C: 0\n      F: F\n      A: 0\n\n   Use the above to try out the movement and fire execution of the fighters.  Try\n   performing loops, figure 8's, tight turns, maximum fire coverage techniques, etc.\n   Start out simple when first playing the game against an opponent.  \n   Eight spacefighters can get very complicated.\n\n9. Changing different parameters creates very different effects on the play of the game.\n   The main effect of a large number of fighters is a more complicated game.  A large\n   number of enteries per round results in a more lively game involving farsighted\n   planning.  Fewer enteries involves more thinking and reacting to immediate developments\n   but is not without strategy when there are multiple fighters opposing each other.\n   The clock provides pressure which can be greatly increased by the moves-to-time ratio.\n   More fire power increases the importance of movement and positioning.  Accumulation\n   of fire power can have long range effects if there is low fire power and a large\n   number of moves per round.\n"}, "./Chip-8 Games/Puzzle": {"name": "Puzzle", "file": "Chip-8 Games/Puzzle.ch8", "sys": "ch8", "description": ""}, "./Chip-8 Games/Reversi [Philip Baltzer]": {"name": "Reversi [Philip Baltzer]", "file": "Chip-8 Games/Reversi [Philip Baltzer].ch8", "sys": "ch8", "description": "6. VIP REVERSI\nReversi is a game over 100 years old, which has become popular recently under the\nname Othello.  The game is played on a 8x8 square, using two kinds of markers.\nIn VIP Reversi one player has the open markers and the other player the solid\nmarkers.  The score for either player at any time is the total number of his markers\non the square.\n\nHow to play VIP Reversi\n\n1. Load the CHIP-8 interpretor at 0000-01FF\n   and the game starting at 0200.\n\n2. Turn RUN switch on.\n\n3. The 8x8 square will be formed and the starting marker configuration shown, having\n   two of each kind of marker in the center four locations of the square.  The starting\n   score for each player is shown as 02 above a line of his markers.\n\n4. Your VIP indicates the player's turn by blinking that player's score and also blinking\n   a cursor dot in the 8x8 square.  A player moves the blinking cursor dot in the 8x8\n   square by pressing the direction keys 1-4 and 6-9 as shown. (VIPG1-6.JPG)\n\n5. When the cursor-dot is properly located, the player presses key 5 to place his marker\n   on the square.  You will find that your VIP will not allow you to make a non-valid\n   play.  The only placements allowed are onces for which at least one of the other\n   player's markers is surrounded between an existing marker of your own and your new\n   marker being placed.  All these markers must be in consecutive positions on the\n   square and can be in any horizontal, vertical or diagonal direction.  Once a new\n   marker has been placed, your VIP will change all such surrounded markers of the\n   other player to your kind and change the scores.\n\n6. Sometimes it may not be possible for a player to make a valid move.  If this happens\n   he must forfeit his move by pressing the \"F\" key! The game ends when neither player\n   can play or when the 8x8 square is completely filled with markers.  The goal is to\n   end the game with the highest score.  Do not be discouraged if during the game you\n   seem to be losing because this is a game with dramatic reversals!  Develop a winning\n   strategem and become a champion!!\n"}, "./Chip-8 Games/Rocket Launch [Jonas Lindstedt]": {"name": "Rocket Launch [Jonas Lindstedt]", "file": "Chip-8 Games/Rocket Launch [Jonas Lindstedt].ch8", "sys": "ch8", "description": ""}, "./Chip-8 Games/Rocket Launcher": {"name": "Rocket Launcher", "file": "Chip-8 Games/Rocket Launcher.ch8", "sys": "ch8", "description": ""}, "./Chip-8 Games/Rocket [Joseph Weisbecker, 1978]": {"name": "Rocket [Joseph Weisbecker, 1978]", "file": "Chip-8 Games/Rocket [Joseph Weisbecker, 1978].ch8", "sys": "ch8", "description": ""}, "./Chip-8 Games/Rush Hour [Hap, 2006] (alt)": {"name": "Rush Hour [Hap, 2006] (alt)", "file": "Chip-8 Games/Rush Hour [Hap, 2006] (alt).ch8", "sys": "ch8", "description": ""}, "./Chip-8 Games/Rush Hour [Hap, 2006]": {"name": "Rush Hour [Hap, 2006]", "file": "Chip-8 Games/Rush Hour [Hap, 2006].ch8", "sys": "ch8", "description": "Rush Hour (v1.1) for CHIP-8 by hap 08-02-08, http://hap.samor.nl/\nOriginally released on 17-12-06. Version 1.1 improves a few things.\nBased on a boardgame by Nobuyuki Yoshigahara \"Nob\" and ThinkFun,\nhttp://www.thinkfun.com/\n\nThis game contains 170 puzzles. Most were taken from the original cardsets,\nsome were made by me, and some were generated with Michel's PyTraffic,\nhttp://alpha.uhasselt.be/Research/Algebra/Members/pytraffic . Refer to\nthe source code for detailed information on this.\n\nHOW TO PLAY\n===========\n\nThe goal of the game is to slide the arrow block(s) out of the 6*6 grid.\nCompleting 10 boards will be awarded with the inclusion of the next boardset(s)\nas seen from the connections on the boardset select screen, a password will be\ngiven so you don't have to complete the game in a single session.\n\n HEX key   PC key*   Use\n---------------------------\n 5         W         up\n 8         S         down\n 7         A         left\n 9         D         right\n A         Z         ok/hold to slide\n 1         1         option(in-game)/back\n\n* = for interpreters that have the 4*4 keypad at 1234/QWER/ASDF/ZXCV.\n"}, "./Chip-8 Games/Russian Roulette [Carmelo Cortez, 1978]": {"name": "Russian Roulette [Carmelo Cortez, 1978]", "file": "Chip-8 Games/Russian Roulette [Carmelo Cortez, 1978].ch8", "sys": "ch8", "description": "Russian Roulette , by: Carmelo Cortez\n\nThis game is called Russian RouLette. Press any key to Spin and pull the Trigger.  \nA \"Click\" or \"Bang\" will show, get ten \"clicks\" in a row and you win."}, "./Chip-8 Games/Sequence Shoot [Joyce Weisbecker]": {"name": "Sequence Shoot [Joyce Weisbecker]", "file": "Chip-8 Games/Sequence Shoot [Joyce Weisbecker].ch8", "sys": "ch8", "description": "12. VIP Sequence Shoot\n\nYou score points by having the sharp-shooter hit the targets in the proper sequence.\n\nHow to Play VIP Sequence Shoot\n\n1. Load the CHIP-8 interpreter at 0000-01FF and\n   the game starting at 0200.\n\n2. Turn RUN switch on.\n\n3. Pressing the Key C causes the little man to shoot the top target, Key D shoots the\n   one below it, Key E the next lower and Key F the bottom target.\n\n4. One of the four targets flashes and the computer waits for you to shoot it.  When\n   you press teh correct key, you get one point.  Then two flash, on after the other.\n   Shoot the one that flashed first, then shoot the other.  This gives you two more\n   points.  Three targets (when hit in the same order as they flashed) add three\n   points to your score.\n\n5. Each time you shoot such a series of targets in proper sequence, your score\n   increases by the number of targets you hit.  An the next series you see is longer\n   by one target.  The maximum length of sequence is 22 targets, that is a score of 254.\n\n6. Improper sequencing of shots in any series ends the game."}, "./Chip-8 Games/Shooting Stars [Philip Baltzer, 1978]": {"name": "Shooting Stars [Philip Baltzer, 1978]", "file": "Chip-8 Games/Shooting Stars [Philip Baltzer, 1978].ch8", "sys": "ch8", "description": "Shooting Stars, by: Philip Baltzer\n\n"}, "./Chip-8 Games/Slide [Joyce Weisbecker]": {"name": "Slide [Joyce Weisbecker]", "file": "Chip-8 Games/Slide [Joyce Weisbecker].ch8", "sys": "ch8", "description": "5. VIP SLIDE\n\nSlide is a two-person game.  Each player tries to slide a \"puck\" over the high-scoring\n\"spots\" without hitting the back wall.\n\nHow To Play VIP Slide\n\n1. Load the CHIP-8 interpretor at 0000-01FF\n   and the game starting at 0200.\n\n2. Turn RUN switch on.\n\n3. The puck moves up and down randomly.  Press \"0\" key to stop the puck.  The puck\n   will move towards the spots after you release the key.  The longer you hold the\n   key down, the further the puck travels (maximum time approximately 2.5 seconds).\n\n4. You get 2 points for hitting the first spot, 4 points for either of the next two\n   spots and 8 points for either of the last two.  The highest score possible is 216\n   (two spots can be hit on one slide).\n\n5. If you hit the back wall, though, you get zero points for that slide, even though\n   you've hit a spot.\n\n6. Each player gets 3 pucks per turn and 6 turns in a game.\n"}, "./Chip-8 Games/Soccer": {"name": "Soccer", "file": "Chip-8 Games/Soccer.ch8", "sys": "ch8", "description": ""}, "./Chip-8 Games/Space Flight": {"name": "Space Flight", "file": "Chip-8 Games/Space Flight.ch8", "sys": "ch8", "description": ""}, "./Chip-8 Games/Space Intercept [Joseph Weisbecker, 1978]": {"name": "Space Intercept [Joseph Weisbecker, 1978]", "file": "Chip-8 Games/Space Intercept [Joseph Weisbecker, 1978].ch8", "sys": "ch8", "description": "Space Intercept, by Joseph Weisbecker\n\nAt startup, Press 1 to select the large UFO whichh counts 5 points when hit or 2 to select the small UFO which counts 15 points when hit.\nLaunch your rocket by pressing key 4,5 or 6. You get 15 rockets as shown in the lower right corner of the screen. Your score is shown in the lower left corner of the screen.\n"}, "./Chip-8 Games/Space Invaders [David Winter] (alt)": {"name": "Space Invaders [David Winter] (alt)", "file": "Chip-8 Games/Space Invaders [David Winter] (alt).ch8", "sys": "ch8", "description": "Space Invaders, by: David Winter\n\nThe well known game. Destroy the invaders with your ship. Shoot\nwith 5, move with 4 and 6. Press 5 to begin a game.\n\n"}, "./Chip-8 Games/Space Invaders [David Winter]": {"name": "Space Invaders [David Winter]", "file": "Chip-8 Games/Space Invaders [David Winter].ch8", "sys": "ch8", "description": "Space Invaders, by: David Winter\n\nThe well known game. Destroy the invaders with your ship. Shoot\nwith 5, move with 4 and 6. Press 5 to begin a game.\n\n"}, "./Chip-8 Games/Spooky Spot [Joseph Weisbecker, 1978]": {"name": "Spooky Spot [Joseph Weisbecker, 1978]", "file": "Chip-8 Games/Spooky Spot [Joseph Weisbecker, 1978].ch8", "sys": "ch8", "description": "Spooky Spot, by: Joseph Weisbecker\n\nNow you can let the computer make your big decisions or predict the future just like governmentt or industry leaders do. \nYou will see the words YES and NO at the right of the screen. Ask the computer any question that can be answered with YES or NO. Press KEY 0 and the spooky spot will show you the computer's answer. This program replaces your old fashioned mechanical OUIJA board.\n"}, "./Chip-8 Games/Squash [David Winter]": {"name": "Squash [David Winter]", "file": "Chip-8 Games/Squash [David Winter].ch8", "sys": "ch8", "description": ""}, "./Chip-8 Games/Submarine [Carmelo Cortez, 1978]": {"name": "Submarine [Carmelo Cortez, 1978]", "file": "Chip-8 Games/Submarine [Carmelo Cortez, 1978].ch8", "sys": "ch8", "description": "Submarine, by: Carmelo Cortez\n\nThe Sub Game is my favorlte. Press \"5\" key to fire depth charges at the subs below. \nYou score 15 points for a small sub and 5 points for the larger. You get 25 depth charges to start."}, "./Chip-8 Games/Sum Fun [Joyce Weisbecker]": {"name": "Sum Fun [Joyce Weisbecker]", "file": "Chip-8 Games/Sum Fun [Joyce Weisbecker].ch8", "sys": "ch8", "description": "11. VIP Sum Fun\n\nThe object of this game is to add up the three digits\nwhich appear in the middle of the screen and then hit\nthe key representing the total as fast as you can.\n\nHow to Play VIP Sum FUn\n\n1. Load the CHIP-8 interpreter at 0000-01FF and\n   the game starting at 0200.\n\n2. Turn RUN switch on.\n\n3. You get twenty sets of three digits per game and\n   between zero and ten points per set.  The faster you\n   enter the correct total, the more points you win.\n\n4. If you wait more that 3 seconds, you get zero points.\n   The correct sum is shown above the three digits after\n   you enter it,  and there is a pause before the next\n   set appears.\n\n5. The score is shown in the upper right-hand corner of\n   the screen.  The maximum number of points you can score\n   is 200.  Between 120 and 159 points is above average.\n   A score of 160 or higher is outstanding.\n\n"}, "./Chip-8 Games/Syzygy [Roy Trevino, 1990]": {"name": "Syzygy [Roy Trevino, 1990]", "file": "Chip-8 Games/Syzygy [Roy Trevino, 1990].ch8", "sys": "ch8", "description": "SYZYGY v0.1\n\nOne of the first games I remember playing on a computer was \ncalled \"syzygy\" on a now ancient TRS-80 Model 1.  It has since\nappeared on other computers under various names.  Why it was\ncalled syzygy, I have no idea (consult Websters).  However, since\nthe HP48SX has approximately the same memory, graphics and cpu\npower as my TRS-80 did (something like 16kB, 128x64, and a 1.2Mhz Z80),\nI thought it would be amusing to play it again.  Now, approximately\nto my recollection, and with many apologies to the original author,\nhere is a CHIP48 version of SYZYGY.  Enough drivel.\n\nThe object of the game is to seek out \"targets\".  You do this with\nyour syzygy.  Initially small, the syzygy will grow by some amount\neach time a target is hit.  Eventually, your syzygy will\nbe so long as to make tougher and tougher to get any points (and easier\nand easier to get killed).  Confused?  Just try it.\n\nAnyways, the syzygy is not allowed to run into anything except targets.\nIt cannot run into the screen border (if present), or itself (this \nincludes backing into itself).  Fast and immediate death will result.\nDon't worry if you die quickly a few times.  The keys take a few \nminutes to get used to.\n\nTo start:     +      start/restart game with border\n              -      start/restart borderless game\n       \nTo play:      9      up\n              6      down\n              1      left\n              2      right\n\n[Hint for frustrated beginners: hold left hand on 1 & 2, and right hand on\n 6 & 9 keys.  Alternate between left hand, right hand, left hand...  -jkh-]\n\n\nFine print (borrowed from Andreas Gustafsson, author of CHIP-48):\n\n  SYZYGY is (c) copyright 1990 by Roy Trevino (RTT)\n\n  Noncommercial distribution allowed, provided that this\n  copyright message is preserved, and any modified versions\n  are clearly marked as such.\n\n  SYZYGY, via CHIP-48, makes use of undocumented low-level features\n  of the HP48SX calculator, and may or may not cause loss of data,\n  excessive battery drainage, and/or damage to the calcultor\n  hardware.  The Author takes no responsibility whatsoever for\n  any damage caused by the use of this program.\n  \n  THIS SOFTWARE IS PROVIDED \"AS IS\" AND WITHOUT ANY EXPRESS OR\n  IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED\n  WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR\n  PURPOSE.\n\nRoy\n\n  --------------------------------------------------------------\n  Roy Trevino                                        Intel Corp.\n  E-mail: rtrevino@sedona.intel.com          Tel: (602) 554 2816\n  UUCP:  decwrl!apple!oliveb!orc!inews!rtrevino@sedona.intel.com\n\u001a"}, "./Chip-8 Games/Tank": {"name": "Tank", "file": "Chip-8 Games/Tank.ch8", "sys": "ch8", "description": "You are in a tank which has 25 bombs. Your goal is to hit 25 times a mobile target. The game ends when all your bombs are shot. If your tank hits the target, you lose 5 bombs. Use 2 4 6 and 8 to move. This game uses the original CHIP8 keyboard, so directions 2 and 8 are swapped.\n"}, "./Chip-8 Games/Tapeworm [JDR, 1999]": {"name": "Tapeworm [JDR, 1999]", "file": "Chip-8 Games/Tapeworm [JDR, 1999].ch8", "sys": "ch8", "description": ""}, "./Chip-8 Games/Tetris [Fran Dachille, 1991]": {"name": "Tetris [Fran Dachille, 1991]", "file": "Chip-8 Games/Tetris [Fran Dachille, 1991].ch8", "sys": "ch8", "description": "                               TETRIS\n                          by Fran Dachille\n\nThis is my first release of the famous Tetris game on the HP48S. I was\ninspired by the lack enjoyable games for our favorite handheld.  [Not since the\nGoodies Disks have been available!  -jkh-]  This game, though it lacks some of\nthe whistles and bangs of fancy versions, performs on par with quality arcade\nversions (nota bene -> SPEED).  At my college, every person who picks up my\ncalculator is immediately hooked for hours.\n\nThis version is written for the CHIP48 game interpreter (c)\ncopyright 1990 Andreas Gustafsson.  \n\nThe 4 key is left rotate, 5 - left move, 6 - right move, 1\n- drop, ENTER - restart, DROP - end.  After every 5 lines, the speed\nincreases slightly and peaks at 45 lines.\n\nThere is room for improvement in this version.  Notably, background\npictures, a pause key (for now, hold ON), two rotate keys, various\nstarting skill levels, a B version which starts with randomn blocks,\nfinishing graphics, and high scores, just to name a few.\n\nIn order for improvements, I need to know if there is reasonable\ndemand.  If this game is worth playing for hours upon hours, please let\nme know.  If you wish to support the improvements, want future versions,\nand want to see other games ported to the HP48S, send $5.00 to:\n\n          FRAN DACHILLE\n          WEBB INSTITUTE\n          GLEN COVE, NY 11542\n\n"}, "./Chip-8 Games/Tic-Tac-Toe [David Winter]": {"name": "Tic-Tac-Toe [David Winter]", "file": "Chip-8 Games/Tic-Tac-Toe [David Winter].ch8", "sys": "ch8", "description": ""}, "./Chip-8 Games/Timebomb": {"name": "Timebomb", "file": "Chip-8 Games/Timebomb.ch8", "sys": "ch8", "description": ""}, "./Chip-8 Games/Tron": {"name": "Tron", "file": "Chip-8 Games/Tron.ch8", "sys": "ch8", "description": ""}, "./Chip-8 Games/UFO [Lutz V, 1992]": {"name": "UFO [Lutz V, 1992]", "file": "Chip-8 Games/UFO [Lutz V, 1992].ch8", "sys": "ch8", "description": "Here's how to play UFO:\n\nYou have a stationary missle launcher at the bottom of the screen. You\ncan shoot in three directions; left diagonal, straight up, and right\ndiagonal.. using the keys 4, 5, and 6 respectively.. You try to hit\none of two objects flying by.. at apparently varying speeds..  Your\nscore is displayed on your left, the number of missles you have left\nis displayed on your right. (You get 15)..\n\nThis game (\"UFO\") is not new.  I have a copy of it from 1977 (!).  It\nwas one of the original CHIP-8 games on the audio cassette that was\nincluded when I bought my first computer, the Finnish-made Telmac\n1800.\n\nIt was also the first real program to run under CHIP-48 (it was used\nas a test case during the development of the CHIP-48 interpreter). The\nreason I have not posted it to the net myself is that I have no idea\nabout its copyright status.  I don't even know where it originated\n(RCA, perhaps?).\n\nThe cassette that was bundled with the Telmac 1800 contains more than\na dozen CHIP-8 programs.  If someone could convince me that these\nprograms are indeed freely redistributable, the other programs could\nalso be posted.  Otherwise, perhaps this one shouldn't have been.\n"}, "./Chip-8 Games/Vers [JMN, 1991]": {"name": "Vers [JMN, 1991]", "file": "Chip-8 Games/Vers [JMN, 1991].ch8", "sys": "ch8", "description": ""}, "./Chip-8 Games/Vertical Brix [Paul Robson, 1996]": {"name": "Vertical Brix [Paul Robson, 1996]", "file": "Chip-8 Games/Vertical Brix [Paul Robson, 1996].ch8", "sys": "ch8", "description": ""}, "./Chip-8 Games/Wall [David Winter]": {"name": "Wall [David Winter]", "file": "Chip-8 Games/Wall [David Winter].ch8", "sys": "ch8", "description": ""}, "./Chip-8 Games/Wipe Off [Joseph Weisbecker]": {"name": "Wipe Off [Joseph Weisbecker]", "file": "Chip-8 Games/Wipe Off [Joseph Weisbecker].ch8", "sys": "ch8", "description": ""}, "./Chip-8 Games/Worm V4 [RB-Revival Studios, 2007]": {"name": "Worm V4 [RB-Revival Studios, 2007]", "file": "Chip-8 Games/Worm V4 [RB-Revival Studios, 2007].ch8", "sys": "ch8", "description": "-----------------------------------------------------------------------------\n\t\t\t      /////////////////\n\t                      //////////////////\n        \t              ////          ////\n\t               \t      ////   ///////////\n\t                      ////  ///////////\n                              ////  ////\n                              ////  ///////////\n                              ////   //////////\n  \t     \t   \t\n  \t\t\t   www.revival-studios.com\n-----------------------------------------------------------------------------\nTitle\t\t:\tSuperWorm V4\nAuthor\t\t:\tRB (Original game)\n\t\t \tUpdates and fixes by: Martijn Wenting / Revival Studios\nGenre\t\t:\tGame\nSystem\t\t:\tChip-8 / SuperChip8\nDate\t\t:\t10/08/2007 \nProduct ID\t:\tRS-C8001\n-----------------------------------------------------------------------------\n\nAll the contents of this package are (c)Copyright 2007 Revival Studios.\nOriginal game: SuperWorm is (c)Copyright 1992 RB\n\nThe contents of the package may only be spread in its original form, and may not be\npublished or distributed otherwise without the written permission of the authors.\n\nDescription:\n------------\nSuperWorm V4 is an update of the SuperChip8 game: Worm3 by RB.\nThe original game was only for SuperChip, so i've created a Chip-8 port.\nIt also includes several speed fixes and a new control system.\n\nRunning the game:\n-----------------\nUse the Megachip emulator or any other Chip-8/SuperChip compatible emulator to run the game.\n\nCredits:\n--------\nChip-8 version, Updates and fixes by: Martijn Wenting\nOriginal game by: RB\n\nDistribution:\n-------------\nThis package can be freely distributed in its original form.\nIf you would like to include this game in your rom package, please let me know.\n\nWatch out for more releases soon!\n\n\n\tMartijn Wenting / Revival Studios\n\n"}, "./Chip-8 Games/X-Mirror": {"name": "X-Mirror", "file": "Chip-8 Games/X-Mirror.ch8", "sys": "ch8", "description": ""}, "./Chip-8 Games/ZeroPong [zeroZshadow, 2007]": {"name": "ZeroPong [zeroZshadow, 2007]", "file": "Chip-8 Games/ZeroPong [zeroZshadow, 2007].ch8", "sys": "ch8", "description": ""}, "./SuperChip Games/Alien [Jonas Lindstedt, 1993]": {"name": "Alien [Jonas Lindstedt, 1993]", "file": "./SuperChip Games/Alien [Jonas Lindstedt, 1993].ch8", "sys": "sch8", "description": "\nWelcome to my second CHIP48 game ever. This time it uses the new features \n(i.e. scrolling and full-screen graphics) that were added in SUPER-CHIP V1.1.\n\nThe game\n--------\nDue to lack of imagination, I did a very wellknown game. Alien, one of the \nfirst games I played in the beginning of the C=64 era. It is a rather simple\nshoot'em up game and the story behind the game is as follows: Unfriendly\n(most aliens are) aliens have invaded the earth and the only one who can stop \nthem are you. To assist you in your battle, the russian experts have \ndeveloped a new powerful (and leathal) weapon, the blaster. But, as you\nknown, the Rubel isn't what it used to be and therefore, the scientists could \nonly afford the version with limited firecapacity. You can only have one shot \nin the air at the same time. And what's even worse: the aliens have gotten \nhold of the very same weapon. And they're continually making their shields \nstronger and stronger. Stop them before they reach mother earth!\n\nHow to start the game\n---------------------\nUpload the game to your HP48-series calulcator via the serial cable. Make \nsure the you also have got S-CHIP V1.1 somewhere in your machine (otherwise \nyou'll have to upload that too). Press the Alien menu-key and a string will \nappear in the first level of the stack (the only thing readable is my name). \nThen press the S-Chip menu-key and the game will begin. See next section for \nfurther description.\n\nThe controls\n------------\nKEY             DESCRIPTION\n\nEnter           Restart the game\nBackspace       Quit game (return to calculating, who needs that?!)\n+/-             Toggle sound on/off (useful when teacher is near you)\n9               Stear your blaster left\n/               Stear your blaster right\n0               Fire (you also use this key to begin playing)\n\nCopyrights\n----------\nCHIP48 V2.25 (C) Andreas Gustafsson, Finland\nS-CHIP V1.1 (C) Erik Bryntse, Sweden\nALIEN V1.0 (C) Jonas Lindstedt, Sweden\n\nThis game is released as Public Domain via Internet and various Bulletin\nBoard Systems. You may copy this program for non-profit purposes. I don't \ntake any responsibility for any damage caused by this program, but please \nwrite me a letter if you find any bugs or have suggestions how to make this a \nbetter game. (I know it's a bit slow, but so am I.)\n                                                \nEnjoy!!\n\nJonas Lindstedt\nDepartment of Real Time Computer Systems\nMalardalens University, Vasteras, Sweden\n-------------------------------------------\nE-mail:         ltd92jlt@martin.mdh.se \n                 or              \n                akcs.jonasl@hpcvbbs.cv.hp.com\n\nAddress:        Jonas Lindstedt\n                Bergmastarv. 15\n                S-724 78  VASTERAS\n                Sweden\n\n"}, "./SuperChip Games/Ant - In Search of Coke [Erin S": {"name": "Ant - In Search of Coke [Erin S", "file": "./SuperChip Games/Ant - In Search of Coke [Erin S. Catto].ch8", "sys": "sch8", "description": ""}, "./SuperChip Games/Blinky [Hans Christian Egeberg, 1991]": {"name": "Blinky [Hans Christian Egeberg, 1991]", "file": "./SuperChip Games/Blinky [Hans Christian Egeberg, 1991].ch8", "sys": "sch8", "description": "Blinky V2.00: Pac Man game for SCHIP V1.0 or newer.\nFrom: egeberg@solan.unit.no (Hans Christian Egeberg)\n\nThis program is for use with Super Chip-48 V1.0 or newer.\nIn order to run, put downloaded binary string on stack, and start SCHIP.\n\nBlinky has two lives. Finishing a screen increases the intelligence\nof Packlett and Heward, the two ghosts. The game is at its most difficult\non the fourth screen. The maze contains one gateway from left to right,\nand four energy pills, near the corners. Points are awarded for each pill,\neach energy pill, catching Packlett, catching Heward, and finishing a maze.\n\nMy personal highscore is 1575 so far, but I am just a programmer.\nMy not so little sister helped me debug, and reached 2005 in two days.\n\n"}, "./SuperChip Games/Car [Klaus von Sengbusch, 1994]": {"name": "Car [Klaus von Sengbusch, 1994]", "file": "./SuperChip Games/Car [Klaus von Sengbusch, 1994].ch8", "sys": "sch8", "description": "Car, by: Klaus von Sengbusch\n\nAnd here is another game.\nIs is quite simple. You just have to drive a car through a scrolling road and\nprevent being hit by other cars. \nOne big advantage for those HP48G Users with 32K memory: IT IS VERY SMALL!!!!!\n\nThe Keys:\n    1: left\n    2: right\n\n\n"}, "./SuperChip Games/Field! [Al Roland, 1993] (alt)": {"name": "Field! [Al Roland, 1993] (alt)", "file": "./SuperChip Games/Field! [Al Roland, 1993] (alt).ch8", "sys": "sch8", "description": ""}, "./SuperChip Games/Field! [Al Roland, 1993]": {"name": "Field! [Al Roland, 1993]", "file": "./SuperChip Games/Field! [Al Roland, 1993].ch8", "sys": "sch8", "description": "\t\t\tFIELD! V1.1\nHere is a quick update to the original FIELD! Super-Chip Game.\nThis version has a few new requested features(variable speed).\nAnd some more details (like explosions and stuff.)\n\nNew Keys:\nThe following keys set the speed of the ship.\n7 - Slowest speed\n8 - A little faster than 7\n4 - Good bit faster than 8\n5 - Very Fast(Good Luck!)\n\nIn case you don't have the original docs:\n1 - moves you right by applying thrust to the left.\n2 - moves you left by applying thrust to the right.\n/ - moves you up\n* - moves you down\n\nAnd as with all CHIP games <- (DROP/CLR/BS) exits to the stack.\n\nYou should have guessed by now that \"7\" no longer stops the current\ngame and returns to the title screen, you can crash quick enough that \nthis is not needed.\n\nThere is a small problem, in that the explosion may be drawn in \nthe wrong spot if you are too close to the edge of the screen, but\nit doesn't last long enough to worry about, and the code needed to\navoid it would make this game needlessly bigger. I think 865 bytes is \nbig enough.\n\n- Al Roland\n  droland@eng.auburn.edu\n"}, "./SuperChip Games/H": {"name": "H", "file": "./SuperChip Games/H. Piper [Paul Raines, 1991].ch8", "sys": "sch8", "description": "\nVersion 2.1 of H. Piper! for SUPER-CHIP follows below.\n\nDISCLAIMER: Since CHIP makes use of undocumented features\nof the HP48SX, anything can happen: loss of data, meltdown,\netc. Therefore, I take no responsibility for any damage\nwhatsoever that occurs.\n\n****************  H. Piper!  **********************\n\nOBJECT:\n-------\nYou are presented with a 6 row, 10 column grid and\na preview panel of 5 pipes. A starting pipe will be\nplaced on the grid and will in a few seconds start\nleaking.  The object is to lay pipes on the grid to\ncontain the leak as long as you can.  If the water\nflows onto an empty grid site, onto the side of another\npipe or border, that plumbing job is finished.  If you\ndid well enough, you may get another job.  Otherwise\nthe game is over.\n\nSTARTING THE GAME:\n-----------------\nMake sure you have the SCHIP program on the calculator.\nPress HPIPER to recall the program string to the stack.\nThen press SCHIP to start the game.\n\nHOW TO PLAY:\n------------\nOn the bottom and right borders of the grid are grid\npointers.  The bottom pointer can be moved left with\nthe (1) key and right with the (2) key.  The side\npointer can be moved up with the (9) key and down with\nthe (6) key. (Note: this is identical to the movement\nkeys for Syzygy by Roy Trevino)  A crosshair is present\non the grid sites the two paddles point to.\n\nUsing the pointers, chose a grid site to place a pipe.\nThe pipe to be placed is the one at the bottom of\nthe preview column. Once a site is chosen, press the\n(7) or (4) key to place the pipe there.  You can replace\na pipe already at the grid site with a penalty of one\npoint.  You cannot replace a pipe that the water has\nalready flown through.  Trying to do this will make\nyou lose the pipe you were trying to place and also\npenalize you one point.\n\nThe two buttons used to place pipe differ in the way\nthat the next pipe added at the top of the queue.\nPressing (7) will choose a random new pipe to place\nat the top of the preview column and push the others\ndown the queue.  Pressing (4) will use the pipe\ncurrently displayed to the right of the grid as the\nnew pipe to be placed at the top of the preview\ncolumn.  The pipes on the right cycle through all\ntypes in a set manner.\n\nWhen you have placed all the pipe you wish to for\na particular job, you can press the (+) key to make\nthe water flow *FAST*.  You can still lay pipe if\nyou realize you made a mistake, but hurry!\n\n   KEY SUMMARY:     Left     (1)\n                    Right    (2)\n                    Up       (9)\n                    Down     (6)\n                    Place    (7)  random\n                    Place    (4)  non-random\n                    Fast     (+)\n\nOnce a job is over, press (SPACE) to continue.\n\nThere are twenty levels with increasing water flow speed.\nLevel 20's speed is the same as that for *FAST*. If\nyou manage to get through level 20, it repeats at\nthat level till you fail.  The starting speed with\nwhich the flow comes out of the initial pipe is slower\nthan the usual flow, however this speed increases in\nlevel also. \n\nSCORING:\n--------\nYou receive 3 points for every pipe the water flows\nthrough.  For the crossed pipes, flowing through\nthem in both directions gives you 6 points.\nYou are penalized 1 point for replacing or\ntrying to replace a pipe already on the grid.\n\nThe current job score is shown in upper right corner.\nThe score can not go negative, so if the score is\nzero, you can replace pipes without penalty.\n\nOnce a job is over, the program checks to see if\nevery grid site was flown through. If so you\nearn a 100 point bonus. The score earned is added to\nthe grand total and displayed on the screen shown\nafter (SPACE) is pressed. \n\nIf the game is over, the word OVER will be displayed\nabove the score and the (SPACE) key can be pressed\nto exit. The total score will be written to user \nflags so that the user lang program SCORE can\nput the score on the stack. If over does not appear,\npress (SPACE) to go on to the next job.\nThe points needed to go to the next job are\nobtained by the following formula:\n\n    Points needed = 100 - (41 - 2 * level)\n\ntherefore, you need 63 points to go to job 2\n                    65 points to go to job 3\n                    ...\n                    99 points to go to job 20,21,....\n\nThe points needed for a level are shown below the\nbottom right corner of a grid.  Note that this\ndoes not mean that play ends once that score\nis achieved.  That score is only a minimum needed\nto have the opportunity to continue on another job.\n\nRESUME:\n-------\nBetween jobs (i.e. while at the dripping faucet wait\nscreen) you can press the decimal (.) key to leave\nthe game and go to the regular calculator mode.  The\ntotal score and level you achieved will be stored in\nthe user flags so that next time you start the game,\nyou will resume the game as you left it.  Do not\nrun the SCORE program or you will lose the resumable\nstate.\n\nIf somehow the user flags get messed up by other\nprograms you run after pausing, you can set them\nusing the HPSET program.  Put the desired score\non level 2 and the game level you just completed\non level 1. Once you get really good at the game,\nyou can use this to bypass the first few really\nslow screens. For example, to start off on level 9,\nenter 0 then 8 and run HPSET. When you start the\ngame, you will begin at level 10.\n\nRANDOMNESS:\n----------\nThe starting pipe for the first level is still \nplaced randomly.  For subsequent levels, however,\nthe starting pipe is located on the grid site\nyou \"leaked\" on with the starting direction opposite\nof that you entered.  If you leaked onto the border,\nthen the starting pipe is placed on the site you\nleaked from.\n\nThe first five pipes in the queue are selected randomly.\n\nOTHER REMARKS:\n-------------\n-- The [ENTER] key will now work to restart\n   the game as if it was just run for the first time.\n-- The movement keys can now be held down to\n   move the crosshair long distances.\n-- Corner pieces are guaranteed for the first four\n   pipes to get out of sticky situations with\n   the starting pipe placement.\n\nTROUBLE SHOOTING:\n----------------\nSome people have reported assorted problems with\ngetting the program to work.  For those who can't get\nSCHIP to work with H. Piper, try turning off all alarms\nand date/clock displays.  If you have Chipper,\nyou might try compiling the source code yourself and\nsee if you can get it to run from there.  \n\n\nDEVELOPMENT NOTES:\n-----------------\nPipe Graphics --\n   As you will probably notice, a lack of\n   color is a big problem in trying to sort\n   out what you have laid out.  Having 8x8\n   pipe bitmaps was a cornerstone of my\n   design so enlarging them for better\n   resolution would be difficult and probably\n   restrict the grid size unduly.\n\nRandomness    --\n   Just how random is S-CHIP's random generator?\n   You will probably notice that the cross pipe\n   comes up more often than the others. True. It\n   is twice as likely to be chosen than any of\n   the others.  Another design fluke. However,\n   being the one true symmetrical piece, it\n   will be the most useful to get often.\n\nProgram Size  --\n   I've put a semi-rigid limit of 2K on the size\n   of the program.  Any improvement that will put it over\n   that barrier just won't be worth it. (I will of course\n   probably eat these words later.)\n\nACKNOWLEDGEMENTS:\n----------------\nH. Piper! was written using the excellent compiler Chipper.\nI will make the source available if there is any interest.\nBe forewarned.  I am a pretty sloppy coder.  There is\nmuch room for improvement in efficiency.\n\n   CHIP-48 is (C) Copyright 1990 Andreas Gustafsson.\n            - Many, many thanks to the one who started it all.\n\n   Chipper is (C) Copyright 1990 Christian Egeberg.\n            - It is amazing that with such a great compiler\n              as this, there are so few CHIP games out there.\n\n   SUPER-CHIP is (C) Copyright 1991 Erik Bryntse\n            - Never be satisfied with limitation.\n\nHappy plumbing!\n\n\n\n\n"}, "./SuperChip Games/Joust [Erin S": {"name": "Joust [Erin S", "file": "./SuperChip Games/Joust [Erin S. Catto, 1993].ch8", "sys": "sch8", "description": "Joust 2.3 Documentation\n-----------------------\n\nBy Erin S Catto\n\nHere is Joust v2.3.  No exciting changes.\nJust mitigation of the bonus round bug.\n\nThe Game:             0    =    start, replay, up\n                      /    =    right\n                      9    =    left\n\nPoints:               1 point per egg touched\n                      8 points for clearing bonus round\n                      1 player for clearing bonus round\n\nNOTE:  Only use SCHIP v1.1 to run this game.  \n"}, "./SuperChip Games/Laser": {"name": "Laser", "file": "./SuperChip Games/Laser.ch8", "sys": "sch8", "description": ""}, "./SuperChip Games/Loopz (with difficulty select) [Hap, 2006]": {"name": "Loopz (with difficulty select) [Hap, 2006]", "file": "./SuperChip Games/Loopz (with difficulty select) [Hap, 2006].ch8", "sys": "sch8", "description": "difficulty select for Loopz, by hap, feb 17th 2006\n\nAndreas Daumann's Loopz was originally only for HP48\nthis change adds difficulty select within the SCHIP program, so it'll work\non SCHIP emulators, no changes were made in the main program\n\nto select difficulty:\nsame keys as in loopz: c=up, d=down, 5=ok\n\nv0,v1,v2 are set before running loopz\nv1 and v2 should be $AA, dunno why\nv0 is the difficulty (0 to 9)\nsaved into flags and the game runs as normal\n\noriginal loopz program: $200-$f9d\ndifficulty select: $f9e-$fff (full ;p )\n\n"}, "./SuperChip Games/Loopz [Andreas Daumann]": {"name": "Loopz [Andreas Daumann]", "file": "./SuperChip Games/Loopz [Andreas Daumann].ch8", "sys": "sch8", "description": ""}, "./SuperChip Games/Magic Square [David Winter, 1997]": {"name": "Magic Square [David Winter, 1997]", "file": "./SuperChip Games/Magic Square [David Winter, 1997].ch8", "sys": "sch8", "description": "****************************************************************************\n                     Üßßß  ÜßßßÜ Û   Û ÜßßßÜ ÜßßßÜ Ûßßßß\n                      ßßßÜ Û  Üß Û   Û ÛßßßÛ ÛßÛß  Ûßß\n                      ßßß   ßß ß  ßßß  ß   ß ß  ß  ßßßßß\n                        A magic square in Super CHIP-8\n                      (C)Copyright 1997 by David WINTER\n****************************************************************************\n\n\n       This game, as well as the others for this scene, are FREE\n       and freely ditributable. If you paid to have it, you have\n       been stolen. If you got money to give it, you're a thief.\n\n\n\n       The rules of this game are very simple: the game is played\n       in a variable size grid made of 3*3 to 8*8 squares, so the\n       level of the game is designated by the width of the grid.\n       Initially, all the squares of the grid are WHITE. The goal\n       is to turn then BLACK by inverting their color, knowing\n       that inverting the colour of a square will also invert these\n       of the squares placed just on the left, right, up and down\n       of it...\n       Some levels are very simple: level 3 can be finished with\n       only 5 inversions, and level 4 needs only 4 inversions to\n       be completed...\n       Once a level is completed, the game is finished. To play\n       again, just reset the emulator.\n\n       I know I could have implemented some sort of inversions\n       counter, and next-level playing after a level is finished,\n       but I missed some time to do this... Anyway, have fun !\n\n       I could also have given the source of this program, but it\n       is not documented, so it would not be interesting to those\n       who are looking for help in programming.\n\n\n       The keys are:\n                   [8] :   UP\n                   [4] :   LEFT (lower level under level selection)\n                   [5] :   INVERT SQUARE (start game under level selection)\n                   [6] :   RIGHT (upper level under level selection)\n                   [2] :   DOWN\n"}, "./SuperChip Games/Matches": {"name": "Matches", "file": "./SuperChip Games/Matches.ch8", "sys": "sch8", "description": ""}, "./SuperChip Games/Mines! - The minehunter [David Winter, 1997]": {"name": "Mines! - The minehunter [David Winter, 1997]", "file": "./SuperChip Games/Mines! - The minehunter [David Winter, 1997].ch8", "sys": "sch8", "description": ""}, "./SuperChip Games/Single Dragon (Bomber Section) [David Nurser, 1993]": {"name": "Single Dragon (Bomber Section) [David Nurser, 1993]", "file": "./SuperChip Games/Single Dragon (Bomber Section) [David Nurser, 1993].ch8", "sys": "sch8", "description": "Greetings All...\n\nI have written the first part of a game called \"Single Dragon\"\nwhich is, if you didn't already guess, a spin off of \"Double Dragon\".\n\nThe only problem is that I didn't think that doing two degrees could be so\nmuch work, and lately it has ground to a halt (exam time ;[).\n\nI have included the ASCed directory of everything I have done so far,\nand am asking you to help me finish this great game off.\n\nHERE IS THE GAME STRATEGY\n\nStages 1-4   ::  Fight Scenes.\n                 Max of 3 enemys on screen @ once\n                 Enemys do not home in on your position in level #1\n                 A big guy to kill @ the end of stage 4\n                 after killing the big guy you jump into a helicopter and\n                      onto stage #5\n\nStage 5      ::  Helicopter Scene - landscape scrolls in from the right\n                 you can bomb ground lauched missiles etc (u get the pic)\n\nStage 6      ::  Car Scene, screen scrolls in from the top\n\nStage 7-10   ::  Fight Scenes of major proportions to finish off.\n\n\nSo, what have I already done?\n-> Stages 1-4 (no big guy @ end yet)\n-> 1/2 of stage 5\n\nAs you can see, I'm about half way through the game and will probably get more\ntime to finish it in about a month, but would really like some moral support\nand perhaps a helping hand.\n\nHOW WAS IT ALL WRITTEN ?\nThe bomber stage (a bit flickery at the moment) and all of the fight\nsequences were written in Super-Chip (Which of course you will need to have\nto run these stages).  All stages are linked by User-Rpl (Flags determine\nmovement between levels.  The introduction is in User-Rpl.  The Fading\nis courtesy of Mr.Meuller (I think...I hope - please correct me if I am wrong)\nwhich was written in System-Rpl.\n\nEventually, all this stuff will be contained in a library, and will be self\nuncompressing as you reach each stage (for those without RAM cards), using\nof course RFU (System-RPL).\n\n\nPlease take the time to have a brief look and tell me what yu think, what I\ncan do with it .... and most importantly ... WHO CAN GIVE ME A BIT OF A HAND\n(I will finish it, but I will surely finish it much faster with your aide)\n\nHere is what is in the directory:\n[INTRO] - speaks for itself - Introduction (1st half - haven't done the second\n                                        yet)\n[BOMB] - Schip Hex String for Bomber Section (what I have done so far)\n[ST1]  - Schip Hex String for Stages 1-2 (that all I'm going to post for the\n         moment ;])\n[DIE]  - The death sequence\n\nMANY THANKS go to my graphic designer Stuart Fisher, and to [Zoom] for\nhis patience...don't worry Zoom, I will finish it ;].\n\nEnjoy.\nDavid Nurser\nitb675nurser@redgum.qut.edu.au\n\n\nPerhaps the lack of response to Single Dragon is because you couldn't\nfigure out the keys...So far, only one person has expressed interest\n...and to tell the truth, it's rather depressing.\nI will gladly send anyone parts of it personally if they are still\nhaving problems downloading etc.\n\nKeys Are:\n[3] - Up\n[SPC] - Down\n[.] - Left\n[+] - Right\n[7] - Punch\n[8] - Kick\n\nHelicopter Scene:\n[8] - Up\n[2] = Down\n[4] = Left\n[6] = Right\n[5] = Bomb\n\nCaio\nDave. [Fish]\n\n"}, "./SuperChip Games/Single Dragon (Stages 1-2) [David Nurser, 1993]": {"name": "Single Dragon (Stages 1-2) [David Nurser, 1993]", "file": "./SuperChip Games/Single Dragon (Stages 1-2) [David Nurser, 1993].ch8", "sys": "sch8", "description": "Greetings All...\n\nI have written the first part of a game called \"Single Dragon\"\nwhich is, if you didn't already guess, a spin off of \"Double Dragon\".\n\nThe only problem is that I didn't think that doing two degrees could be so\nmuch work, and lately it has ground to a halt (exam time ;[).\n\nI have included the ASCed directory of everything I have done so far,\nand am asking you to help me finish this great game off.\n\nHERE IS THE GAME STRATEGY\n\nStages 1-4   ::  Fight Scenes.\n                 Max of 3 enemys on screen @ once\n                 Enemys do not home in on your position in level #1\n                 A big guy to kill @ the end of stage 4\n                 after killing the big guy you jump into a helicopter and\n                      onto stage #5\n\nStage 5      ::  Helicopter Scene - landscape scrolls in from the right\n                 you can bomb ground lauched missiles etc (u get the pic)\n\nStage 6      ::  Car Scene, screen scrolls in from the top\n\nStage 7-10   ::  Fight Scenes of major proportions to finish off.\n\n\nSo, what have I already done?\n-> Stages 1-4 (no big guy @ end yet)\n-> 1/2 of stage 5\n\nAs you can see, I'm about half way through the game and will probably get more\ntime to finish it in about a month, but would really like some moral support\nand perhaps a helping hand.\n\nHOW WAS IT ALL WRITTEN ?\nThe bomber stage (a bit flickery at the moment) and all of the fight\nsequences were written in Super-Chip (Which of course you will need to have\nto run these stages).  All stages are linked by User-Rpl (Flags determine\nmovement between levels.  The introduction is in User-Rpl.  The Fading\nis courtesy of Mr.Meuller (I think...I hope - please correct me if I am wrong)\nwhich was written in System-Rpl.\n\nEventually, all this stuff will be contained in a library, and will be self\nuncompressing as you reach each stage (for those without RAM cards), using\nof course RFU (System-RPL).\n\n\nPlease take the time to have a brief look and tell me what yu think, what I\ncan do with it .... and most importantly ... WHO CAN GIVE ME A BIT OF A HAND\n(I will finish it, but I will surely finish it much faster with your aide)\n\nHere is what is in the directory:\n[INTRO] - speaks for itself - Introduction (1st half - haven't done the second\n                                        yet)\n[BOMB] - Schip Hex String for Bomber Section (what I have done so far)\n[ST1]  - Schip Hex String for Stages 1-2 (that all I'm going to post for the\n         moment ;])\n[DIE]  - The death sequence\n\nMANY THANKS go to my graphic designer Stuart Fisher, and to [Zoom] for\nhis patience...don't worry Zoom, I will finish it ;].\n\nEnjoy.\nDavid Nurser\nitb675nurser@redgum.qut.edu.au\n\n\nPerhaps the lack of response to Single Dragon is because you couldn't\nfigure out the keys...So far, only one person has expressed interest\n...and to tell the truth, it's rather depressing.\nI will gladly send anyone parts of it personally if they are still\nhaving problems downloading etc.\n\nKeys Are:\n[3] - Up\n[SPC] - Down\n[.] - Left\n[+] - Right\n[7] - Punch\n[8] - Kick\n\nHelicopter Scene:\n[8] - Up\n[2] = Down\n[4] = Left\n[6] = Right\n[5] = Bomb\n\nCaio\nDave. [Fish]\n\n"}, "./SuperChip Games/Sokoban [Hap, 2006] (alt)": {"name": "Sokoban [Hap, 2006] (alt)", "file": "./SuperChip Games/Sokoban [Hap, 2006] (alt).ch8", "sys": "sch8", "description": ""}, "./SuperChip Games/Sokoban [Hap, 2006]": {"name": "Sokoban [Hap, 2006]", "file": "./SuperChip Games/Sokoban [Hap, 2006].ch8", "sys": "sch8", "description": "Sokoban, a port of Sokoban to SCHIP, by hap, April 11th, 2006.\nOriginal by Thinking Rabbit, 1982.\n\nI won't explain the concept of this game, you probably already know. The game\ncontains the original floors, all 50 of them, that have been verified against\nthe 1984 PC version.\n\nIt has been tested, and works fine on my CHIP8 emulator, Fish 'n' Chips,\ncomfortable gameplay is at about 1.2Khz. It has also been successfully tested\non HP48 SCHIP, using EMU48.\n\n\nHOW TO PLAY\n===========\n\n[x]=CHIP8 hexpad key\n{x}=key in a PC emulator that emulates it on 1234/qwer/asdf/zxcv\n\nTitlescreen:\nSelect a floor with [7]{a} and [9]{d}, and enter it with [a]{z}. The floor will\nnow be drawn onto the screen.\n\nGame:\nMove with [5]{w}, [8]{s}, [7]{a}, [9]{d}. You can undo moves up to 57 times\nwith [a]{z}. To restart, hold [0]{x}, and to exit to the titlescreen, restart\nbefore making a move.\n\n\nCREDITS\n=======\n\nFloors were converted to textfiles, these are available all over the internet.\nThanks to whoever converted them in the first place, as I used them to, erm,\nreconvert them. Note that I found some floors containing errors while comparing\nagainst screenshots made from the original Sokoban, though maybe they were\nintentionally changed(?)\n"}, "./SuperChip Games/Spacefight 2091 [Carsten Soerensen, 1992]": {"name": "Spacefight 2091 [Carsten Soerensen, 1992]", "file": "./SuperChip Games/Spacefight 2091 [Carsten Soerensen, 1992].ch8", "sys": "sch8", "description": "\t\t\t\t\t\t\tAarhus, DK\n\t\t\t\t\t\t\t16/9-92\n\n\nSpaceFight2091  - The doc\n\nOk, here's a little Super-Chip game for all you mad S-Chip-freaks out there!\n\n\n\n\nPURPOSE:\n\nThe purpose of the game is.... TO WIN (say what?)\n  In order to complete this quite difficult task your body (yes only your body\nand not your mind (this remark shows that I believe that the body merely serves\nas a tool for the brain)) have been warped through 87 different time-warps\ndue to some foolish scientists who didn't know what they were doing. This\nresulted in a rather big waste of resources but that's of course another story.\nWhen you finally arrive you can't recognize anything and two weird-looking\ndudes tell you that this is the year 2091!!! Frightening eh?\n  You are of course not very happy about your situation partly because you only\nhave 25 dollars in your wallet and the prizes have gone up about 30000% but\nmainly because IBM and the fucking PC clones have completely taken over all of\nthe computer-market resulting in the Amiga's death!\n  In a Holo-BiDirectional-FullDuplex-TV-store you see a newsflash concerning\nsome evil aliens about to invade the good ol' EARTH. Scientists think that they\nare being drawn towards the Earth due to the massive pollution the PC's cause.\nHowever if people had bought Amiga's instead (which don't pollute) they would\nhave been no aliens now!\n  This is your call! You sneak into a Warp-Transporter without a ticket and you\nend up at NASA where you get to talk to the boss and you tell him : \"OK you\nlisten to me you scumbag! I wanna get into a spacecraft, get up there and KICK\nSOME ALIEN BUTT!\". \"But why?\" the boss says. \"Personal motives\" you answer. If\nyou can save the Amigas existence you're ready to do anything!\n  You get the newest spacecraft (ZX-81) and you take off!!! TO SAVE THE AMIGA!\n  Battle you way through the 6 (increasingly harder) levels!!!\n\n\n\n\nCONTROLLING THE ZX-81\n\n  Though being very advanced the ZX-81 is extremely easy to control:\n\n  HexPad    Amiga    HP    Function\n\n    3         /      9      LEFT\n    C         *      /      RIGHT\n    A         1      0      FIRE\n\n\n\n\nABOUT THE GAME\n\n  It was written because I wanted to test my newly written S-Chip assembler for\nthe Amiga. It only took me 2 days to make this game (I'm so proud of myself!).\nI know that some of the code could have been programmed smarter (or smaller!)\nbut then again it was my first attempt so get off my back!\n\n  SourceSize: about 30 k\n  AsmSize:    2840 bytes\n  783 bytes of graphics and 200 bytes of buffers, reducing the codesize to\n  1857 bytes\n\nContact me for anything concerning CHIP like ideas for more games...\n\nSlammer\nCarsten Soerensen\nKronhjortevej 4\nDK-8270  Hoejbjerg\nDenmark\n\nE-Mail: u920659@daimi.aau.dk\n\n"}, "./SuperChip Games/Super Astro Dodge [Revival Studios, 2008]": {"name": "Super Astro Dodge [Revival Studios, 2008]", "file": "./SuperChip Games/Super Astro Dodge [Revival Studios, 2008].ch8", "sys": "sch8", "description": "-----------------------------------------------------------------------------\n\t\t\t      /////////////////\n\t                      //////////////////\n        \t              ////          ////\n\t               \t      ////   ///////////\n\t                      ////  ///////////\n                              ////  ////\n                              ////  ///////////\n                              ////   //////////\n  \t     \t   \t\n  \t\t\t   www.revival-studios.com\n-----------------------------------------------------------------------------\nTitle\t\t:\tAstro Dodge\nAuthor\t\t:\tMartijn Wenting / Revival Studios\nGenre\t\t:\tGame\nSystem\t\t:\tChip8 / SuperChip8\nDate\t\t:\t18/12/2008\nProduct ID\t:\tRS-C8003\n-----------------------------------------------------------------------------\n\nAll the contents of this package are (c)Copyright 2008 Revival Studios.\n\nThe contents of the package may only be spread in its original form, and may not be\npublished or distributed otherwise without the written permission of the authors.\n\nDescription:\n------------\nAstro Dodge is an arcade game for the Chip8 and SuperChip8 systems.\nBoth versions of the game are included in this package.\n \nYour goal is to make your way through the asteroids field and dodge the asteroids, scoring points for each asteroid you are able to dodge.\nButton 2,4,6,8 will move your ship, button 5 will start the game.\n\nRunning the game(s):\n--------------------\nThe CHIP8 version of the game has been programmed to be compatible with original hardware like the Cosmac VIP and Telmac 1800.\nUse the Megachip emulator or any other Chip8/SuperChip compatible emulator to run the game(s).\n\nCredits:\n--------\nProgramming and Graphics by: Martijn Wenting\n\nDistribution:\n-------------\nThis package can be freely distributed in its original form.\nIf you would like to include this game in your rom package, please let me know.\n\nWatch out for more releases soon!\n\n\n\tMartijn Wenting / Revival Studios\n\n"}, "./SuperChip Games/SuperWorm V3 [RB, 1992]": {"name": "SuperWorm V3 [RB, 1992]", "file": "./SuperChip Games/SuperWorm V3 [RB, 1992].ch8", "sys": "sch8", "description": ""}, "./SuperChip Games/SuperWorm V4 [RB-Revival Studios, 2007]": {"name": "SuperWorm V4 [RB-Revival Studios, 2007]", "file": "./SuperChip Games/SuperWorm V4 [RB-Revival Studios, 2007].ch8", "sys": "sch8", "description": "-----------------------------------------------------------------------------\n\t\t\t      /////////////////\n\t                      //////////////////\n        \t              ////          ////\n\t               \t      ////   ///////////\n\t                      ////  ///////////\n                              ////  ////\n                              ////  ///////////\n                              ////   //////////\n  \t     \t   \t\n  \t\t\t   www.revival-studios.com\n-----------------------------------------------------------------------------\nTitle\t\t:\tSuperWorm V4\nAuthor\t\t:\tRB (Original game)\n\t\t \tUpdates and fixes by: Martijn Wenting / Revival Studios\nGenre\t\t:\tGame\nSystem\t\t:\tSuperChip8\nDate\t\t:\t10/08/2007 \nProduct ID\t:\tRS-C8001\n-----------------------------------------------------------------------------\n\nAll the contents of this package are (c)Copyright 2007 Revival Studios.\nOriginal game: SuperWorm is (c)Copyright 1992 RB\n\nThe contents of the package may only be spread in its original form, and may not be\npublished or distributed otherwise without the written permission of the authors.\n\nDescription:\n------------\nSuperWorm V4 is an update of the Chip8/SuperChip8 game: Worm3 by RB.\nIt includes several speed fixes and a new control system.\n\nRunning the game:\n-----------------\nUse the Megachip emulator or any other SuperChip compatible emulator to run the game.\n\nCredits:\n--------\nOriginal game by: RB\nUpdates and fixes by: Martijn Wenting\n\nDistribution:\n-------------\nThis package can be freely distributed in its original form.\nIf you would like to include this game in your rom package, please let me know.\n\nWatch out for more releases soon!\n\n\n\tMartijn Wenting / Revival Studios\n\n"}, "./SuperChip Games/U-Boat [Michael Kemper, 1994]": {"name": "U-Boat [Michael Kemper, 1994]", "file": "./SuperChip Games/U-Boat [Michael Kemper, 1994].ch8", "sys": "sch8", "description": " Subject:  U-BOAT v1.0  (c)1994 Michael D. Kemper\nReleased:  v1.0 - 8/8/94\nRequires:  S-CHIP interpreter which can be found on Joseph Horn's\n           goodies disk 3.\n\nThis game is based on a game that I used to play back in the early 80's\non an Apple ][.  I believe the name of the program was \"Depth Charge.\"\nUnfortunately I don't know who was responsible for programming it.\n\nThe premise of the game is fairly simple.  You are the Captain of a sub\nhunting destroyer, and your objective is to sink as many enemy U-Boats as\nyou can.  Your only weapon against the U-Boats is your ship's supply of\ndepth charges.  You have an unlimited supply of charges but, due to the\namount of time it takes your second rate crew to reload, you may only have\nfour charges in the water at any given time.\n\nThe subs that you are hunting appear at random depths and have one of\nthree random velocities (stopped, ahead half, or ahead full).\nThere are six enemy subs visible at any one time.  When one of these\nsubs is destroyed, another will appear at a different location.\n\nThe keys used are as follows:\n\n     [1]     ship's speed full stop\n     [2]     ship's speed ahead half\n     [3]     ship's speed ahead full\n     [-]     drop depth charge\n     [/]     abort game\n     [+/-]   toggle sound\n     [<-]    exit program\n     [Enter] restart program\n\nScoring for the game is based on the depth of the sub, multiplied by one\nplus it's velocity.  For example:\nIf a sub is at a depth of 50, and he is stopped then he is worth 50 points.\nA sub at the same depth of 50, but moving at 1/2 speed is worth 100 points.\nA sub at a depth of 50, but moving at full speed is worth 150 points.\n\nThe time limit for the game is about 2.5 minutes.  At about 1:45 into the\ngame a warning buzzer goes off and an almost empty hourglass is displayed\nby your score to let you know that the game is about over.\n\nOnce the game is over your score, the high score, the number of charges\ndropped, the number of subs hit, and your hit percentage are displayed.\n\nA good game is about 2800 or so, and a really good game is around 3500.  I\nhaven't had a whole lot of time to play it, but my high is 3551.\n\n----------------------------------------------------------------------------\n\nThanks to Erik Bryntse for his S-CHIP interpreter, which was an extension\nto Andreas Gustafsson's CHIP-48 interpreter.  Thanks also to Christian\nEgeberg for his CHIPPER v2.11 assembler.  A big thanks to Joseph Horn for\ncollecting various HP48 programs and utilities.  His goodies files are just\nabout my only source of information on this fascinating calculator.\n\nIf there are any questions, comments or criticism's they can be emailed\nto mikek@access.mountain.net\n\nThis game is freeware, and may be distributed freely as long as this doc\nfile remains with it, and both the doc and program remain unchanged.  If\nyou find that you become wildly addicted to U-BOAT and can't sleep at\nnight knowing that I didn't receive any compensation for writing it then\nby all means send me enough to allow you to get your z's.\n\n============================================================================\nDisclaimer:\n     This program uses \"Super-Chip\" which makes use of undocumented\n     low-level features of the HP48 calculator, and may or may not\n     cause loss of data, excessive battery drainage, and/or damage to\n     the calculator hardware.  The author takes no responsibility\n     whatsoever for any damage caused by the use of this program.\n============================================================================"}}